/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putchar.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: root <root@student.42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/03/22 23:42:20 by root              #+#    #+#             */
/*   Updated: 2022/04/10 23:54:39 by root             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* écrit sur la sortie standard le caractère recu dans "src"				  */

#include "libft.h"

void	ft_putchar(char src)
{
	write(1, &src, 1);
}
